import { Subject } from '../../types'

export const prepPE: Subject = {
  title: "Физкультура",
  icon: "Dumbbell",
  color: "text-orange-400",
  topics: ["Ходьба и бег", "Прыжки", "Игры", "Гимнастика"],
  detailedTopics: [
    {
      topic: "Физкультура",
      lessons: [
        { title: "Урок 1: Ходьба и бег", description: "Основы движения.", tasks: ["Ходить правильно", "Бегать", "Чередовать ходьбу и бег", "Играть в игры"] },
        { title: "Урок 2: Прыжки", description: "Прыжковые упражнения.", tasks: ["Прыгать на двух ногах", "Прыгать на одной", "Прыгать через предметы", "Играть в игры"] },
        { title: "Урок 3: Подвижные игры", description: "Игры на свежем воздухе.", tasks: ["Играть в игры", "Соблюдать правила", "Двигаться активно", "Работать в команде"] },
        { title: "Урок 4: Гимнастика", description: "Гимнастические упражнения.", tasks: ["Делать зарядку", "Упражнения для рук", "Упражнения для ног", "Растяжка"] }
      ]
    }
  ]
}
