import { Subject } from '../../types'

export const prepSpeech: Subject = {
  title: "Развитие речи",
  icon: "MessageCircle",
  color: "text-teal-400",
  topics: ["Артикуляция", "Скороговорки", "Предложения", "Сказки"],
  detailedTopics: [
    {
      topic: "Развитие речи",
      lessons: [
        { title: "Урок 1: Звуки речи", description: "Знакомство со звуками.", tasks: ["Произнести звуки", "Найти слова на звук", "Определить первый звук", "Подобрать слова"] },
        { title: "Урок 2: Слова и слоги", description: "Деление на слоги.", tasks: ["Хлопнуть слоги", "Посчитать слоги", "Назвать слоги", "Составить слово"] },
        { title: "Урок 3: Предложение", description: "Понятие о предложении.", tasks: ["Составить предложение", "Посчитать слова", "Начать с большой буквы", "Поставить точку"] },
        { title: "Урок 4: Слушание сказок", description: "Прослушивание сказок.", tasks: ["Прослушать сказку", "Ответить на вопросы", "Пересказать", "Назвать героев"] }
      ]
    }
  ]
}
